{"blogs":[{"relativeClientUrl":"blog/detail/the-reason-why-i-write-blog.html","name":"The Reason Why I Write Blog","markedHtml":"<p><img src=\"https://terry-su.github.io/BlogCDN/images/blog.jpg\" alt=\"\"></p>\n<p>Main reason:</p>\n<ol>\n<li>summarize the knowledge learned </li>\n<li>share knowledge</li>\n<li>communicate with others</li>\n</ol>\n<p>Secondary reson:</p>\n<ol>\n<li>refine thoughts</li>\n<li>add fun to daily life</li>\n<li>build personal website</li>\n</ol>\n<h2 id=\"summarize-the-knowledge-learned\">Summarize the knowledge learned</h2>\n<p>As a front-end engineer, I keep learning new knowledge almost all the time. Obviously most people are keeping learning new things too.<br>After learning one knowledge,  it&#39;s best to use it as much as possible so that we get more and more familiar with it until finally master it. However, in majority of situations, we have no enough scenes to practice the knowledge just learned. Wouldn&#39;t it be great if there&#39;s a method and it&#39;s suitable for any knowledge?<br>Yep, writing blog is a method. We summarize the knowledge in our own language, we get familiar with the knowledge by showing its application examples, and we master the knowledge by explaining it easily to readers.</p>\n<h2 id=\"share-knowledge-communicate-with-others\">Share knowledge, communicate with others</h2>\n<p>Now that having written an blog and post it online, I&#39;m displaying it to others. There&#39;re 2 options then. One is that writing articles only I will read, the other is writing articles that not only help myself review the knowledge but also are useful to others. As you can tell, my choice is the second one. By sharing knowledge and communicate with others, I&#39;m able to:</p>\n<ol>\n<li>express my views</li>\n<li>find peers in same kind</li>\n<li>get feedback</li>\n</ol>\n<h2 id=\"refine-thoughts\">Refine thoughts</h2>\n<p>Writing helps to organize my thoughts, to inspire myself to produce great ideas and to generate new views, etc.</p>\n<h2 id=\"add-fun-to-daily-life\">Add fun to daily life</h2>\n<p>The process of learning is boring sometimes. However, when writing a blog, I can do something interesting. I can create an animation to show complex and boring theory vividly, for example,.</p>\n<h2 id=\"build-personal-website\">Build personal website</h2>\n<p>This blog website is built completely from 0 to 1, without using any blog templates. The advantage is that styling website and adding custom features are very easy to conduct now despite of long complicated work at  an earlier stage.<br>Blog contents are undoubtedly the most important thing for readers. Nevertheless, good reading experience is also important for readers, such as the style and the interaction on website.  </p>\n","createTime":"2019/1/16 15:00","categorySequence":["All","About Author"],"introduction":"[https://terry-su.github.io/BlogCDN/images/blog.jpg] Main reason: 1. summarize the knowledge learned...","uniqueHtmlName":"the-reason-why-i-write-blog","blogProps":{"createTime":"2019/1/16 15:00","tags":["author"],"comment":"14"}},{"relativeClientUrl":"blog/detail/about-author.html","name":"About Author","markedHtml":"<p>Hi, glad to meet you, welcome to visit my blog. I&#39;m Terry Su, a 3 years Front-End engineer from China, who loves English very much.</p>\n<p>I&#39;ve learned English seriously these years and kept practicing thinking in English, and it turns out that now I can express my ideas in English naturally without interpreting them from Chinese, though it may be non-native.</p>\n<p>You can contact me by:</p>\n<ul>\n<li>Email: <a href=\"mailto:theterrysu@163.com\">theterrysu@163.com</a></li>\n<li><a href=\"https://twitter.com/theterrysu\">Twitter</a>  </li>\n</ul>\n","createTime":"2018/9/24 16:37","categorySequence":["All","About Author"],"introduction":"Hi, glad to meet you, welcome to visit my blog. I'm Terry Su, a 3 years Front-End engineer from China,...","uniqueHtmlName":"about-author","blogProps":{"createTime":"2018/9/24 16:37","tags":["author"],"comment":"10"}}]}
